src/cf/Catalogs/ПодписиПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПодписиПисем</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Может быть в формате HTML или в формате Простого текста</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецПодписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ПодписиПисем/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ОкноHTMLДокумента; // см СодержаниеДокументСформирован

&НаКлиенте
Перем ДокументHTML; // см СодержаниеДокументСформирован

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		РаботаССодержаниемДляНовогоОбъекта();
	Иначе
		РаботаССодержаниемДляСуществующегоОбъекта();
	КонецЕсли;
	
	ИзначальноеЗаполнениеРеквизитов();
	УстановитьНачальныйВидФормы();
	ИзменитьФормуДляМобильногоКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ТипСодержанияПисьма = ПредопределенноеЗначение("Перечисление.ТипыТекстовЭлектронныхПисем.HTML") Тогда
		
		Если ПустаяСтрока(ДокументHTML.body.style.lineHeight) Тогда
			Результат = СтрШаблон("<html><body>%1</body></html>", ДокументHTML.body.innerHTML);
		Иначе
			Результат = СтрШаблон("<html><body style=""line-height:%1;"">%2</body></html>",
			ДокументHTML.body.style.lineHeight,
			ДокументHTML.body.innerHTML);
		КонецЕсли;
		
		Объект.Содержание = Результат;
		
	Иначе
		Объект.Содержание = Содержание;
	КонецЕсли;
	
	ПараметрыЗаписи.Вставить("ПредыдущийВладелецПодписи", Объект.ВладелецПодписи);
	ПараметрыЗаписи.Вставить("ЭтоНовый", Объект.Ссылка.Пустая());
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПараметрыЗаписи.Вставить("НужноЗадатьВопросОбУстановкеОсновнойПодписи", Ложь);
	
	Если Справочники.ПодписиПисем.ЭтоОсновнаяПодпись(Объект.Ссылка) Тогда
		
		Если ПараметрыЗаписи.ПредыдущийВладелецПодписи <> Справочники.ПодписиПисем.ПустаяСсылка()
			И ПараметрыЗаписи.ПредыдущийВладелецПодписи <> Объект.ВладелецПодписи Тогда
			
			Справочники.ПодписиПисем.ОтменитьИспользованиеПодписиКакОсновной(
			Объект.Ссылка, ПараметрыЗаписи.ПредыдущийВладелецПодписи);
			
		КонецЕсли;
		
	Иначе
		
		ПараметрыЗаписи.Вставить("НужноЗадатьВопросОбУстановкеОсновнойПодписи",
		НужноЗадатьВопросОбУстановкеОсновнойПодписи(ПараметрыЗаписи.ЭтоНовый));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.Свойство("ЗаписатьИЗакрыть") Тогда
		ЗакрытьОкно = Истина;
	Иначе
		ЗакрытьОкно = Ложь;
	КонецЕсли;
		
	Если ПараметрыЗаписи.НужноЗадатьВопросОбУстановкеОсновнойПодписи Тогда
		ВопросОбУстановкеОсновнойПодписи(ЗакрытьОкно);
	Иначе
		ДействияПослеЗаписиНаКлиенте(ЗакрытьОкно);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СодержаниеДокументСформирован(Элемент)
	
	ГипертекстКлиент.ДокументHTMLСформирован(
	Элемент,
	ДокументHTML,
	ОкноHTMLДокумента,
	ТекущийЭлемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СодержаниеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ЭлементыКомандВставкиТаблиц = Новый Массив;
	ЭлементыКомандВставкиТаблиц.Добавить(Элементы.КомандаВставитьТаблицу);
	
	ЭлементыКомандИзмененияТаблиц = Новый Массив;
	ЭлементыКомандИзмененияТаблиц.Добавить(Элементы.КомандаИзменитьТаблицу);
	ЭлементыКомандИзмененияТаблиц.Добавить(Элементы.КомандаИзменитьТаблицу1);
	
	ГипертекстКлиент.РедактируемоеПолеHTMLДокументаПриНажатии(
	ДанныеСобытия,
	СтандартнаяОбработка,
	Элементы,
	Элементы.КомандыФорматированияСодержания.Имя,
	ЭлементыКомандВставкиТаблиц,
	ЭлементыКомандИзмененияТаблиц);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область КомандыHTMLПоля

&НаКлиенте
Процедура ОбработатьHTMLКоманду(Команда)
	
	НазваниеКоманды = Сред(Команда.Имя, 8, СтрДлина(Команда.Имя));
	ГипертекстКлиент.ВыполнитьHTMLКоманду(НазваниеКоманды, ПараметрыДляПередачиВМодульГипертекст());
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьШрифт(Команда)
	
	ГипертекстКлиент.ИзменитьШрифт(ПараметрыДляПередачиВМодульГипертекст());
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьШрифт(Команда)
	
	ГипертекстКлиент.ИзменитьРазмерШрифта(ПараметрыДляПередачиВМодульГипертекст(), 1);
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьШрифт(Команда)
	
	ГипертекстКлиент.ИзменитьРазмерШрифта(ПараметрыДляПередачиВМодульГипертекст(), -1);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекста(Команда)
	
	ГипертекстКлиент.ИзменитьЦветТекста(ПараметрыДляПередачиВМодульГипертекст(), "ВыбранныйЦветТекстаHTML");
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветФона(Команда)
	
	ГипертекстКлиент.ИзменитьЦветФонаСТаблицей(ПараметрыДляПередачиВМодульГипертекст(), "ВыбранныйЦветФонаHTML");
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьГиперссылку(Команда)
	
	ГипертекстКлиент.ВставитьГиперссылку(ПараметрыДляПередачиВМодульГипертекст());
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСимвол(Команда)
	
	ГипертекстКлиент.ВставитьСимвол(ПараметрыДляПередачиВМодульГипертекст());
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзменитьТаблицу(Команда)
	
	ГипертекстКлиент.ВставитьИзменитьТаблицу(ПараметрыДляПередачиВМодульГипертекст());
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТаблицу(Команда)
	
	ГипертекстКлиент.ИзменитьТаблицу(ПараметрыДляПередачиВМодульГипертекст());
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВставить(Команда)
	
	ГипертекстКлиент.КомандаВставить(ПараметрыДляПередачиВМодульГипертекст());
	
КонецПроцедуры

&НаКлиенте
Процедура Цитирование(Команда)
	
	ГипертекстКлиент.Цитировать(ПараметрыДляПередачиВМодульГипертекст());
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзображение(Команда)
	
	ГипертекстКлиент.ВставитьИзображение(ПараметрыДляПередачиВМодульГипертекст());
	
КонецПроцедуры

&НаКлиенте
Процедура МеждустрочныйИнтервал(Команда)
	
	ГипертекстКлиент.ИзменитьМеждустрочныйИнтервал(ПараметрыДляПередачиВМодульГипертекст());
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВернуть(Команда)
	ОкноHTMLДокумента.redo();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменить(Команда)
	ОкноHTMLДокумента.undo();
КонецПроцедуры

&НаКлиенте
Процедура ПереключательHTML(Команда)
	
	ПараметрыДляПередачи = Новый Структура;
	ПараметрыДляПередачи.Вставить("Форма", ЭтотОбъект);
	ПараметрыДляПередачи.Вставить("НазваниеРеквизитаСодержания", "Содержание");
	ПараметрыДляПередачи.Вставить("НазваниеРеквизитаТипаСодержания", "ТипСодержанияПисьма");
	ПараметрыДляПередачи.Вставить("Страницы", Элементы.СтраницыТипыСодержаний);
	ПараметрыДляПередачи.Вставить("СтраницаHTML", Элементы.СтраницаТекстHTML);
	ПараметрыДляПередачи.Вставить("СтраницаПростойТекст", Элементы.СтраницаПростойТекст);
	ПараметрыДляПередачи.Вставить("ГруппаСКомандамиПереключения", Элементы.АктивныйВидПисьма);
	ПараметрыДляПередачи.Вставить("КомандаHTML", Элементы.ФормаПереключательHTML);
	ПараметрыДляПередачи.Вставить("КомандаПростойТекст", Элементы.ФормаПереключательПростойТекст);
	ПараметрыДляПередачи.Вставить("ДокументHTML", ДокументHTML);
	ПараметрыДляПередачи.Вставить("ПолеHTML", Элементы.Содержание);
	
	ГипертекстКлиент.ПереключательHTML(ПараметрыДляПередачи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательПростойТекст(Команда)
	
	ПараметрыДляПередачи = Новый Структура;
	ПараметрыДляПередачи.Вставить("Форма", ЭтотОбъект);
	ПараметрыДляПередачи.Вставить("НазваниеРеквизитаСодержания", "Содержание");
	ПараметрыДляПередачи.Вставить("НазваниеРеквизитаТипаСодержания", "ТипСодержанияПисьма");
	ПараметрыДляПередачи.Вставить("Страницы", Элементы.СтраницыТипыСодержаний);
	ПараметрыДляПередачи.Вставить("СтраницаHTML", Элементы.СтраницаТекстHTML);
	ПараметрыДляПередачи.Вставить("СтраницаПростойТекст", Элементы.СтраницаПростойТекст);
	ПараметрыДляПередачи.Вставить("ГруппаСКомандамиПереключения", Элементы.АктивныйВидПисьма);
	ПараметрыДляПередачи.Вставить("КомандаHTML", Элементы.ФормаПереключательHTML);
	ПараметрыДляПередачи.Вставить("КомандаПростойТекст", Элементы.ФормаПереключательПростойТекст);
	ПараметрыДляПередачи.Вставить("ДокументHTML", ДокументHTML);
	
	ГипертекстКлиент.ПереключательПростойТекст(ПараметрыДляПередачи);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ЗаписатьИЗакрыть", Истина);
	Записать(ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаСобытийФормы

&НаСервере
Процедура РаботаССодержаниемДляНовогоОбъекта()
	
	Если Не ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		Содержание = "<html><body contenteditable>
		|<div><br></div>
		|<div>------------------------------</div>
		|<div><br></div>
		|</body></html>";
		Гипертекст.ДобавитьJSКод(Содержание);
		
		ТипСодержанияПисьма = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
		
	Иначе
		
		Если СтрНайти(Объект.Содержание, "<html") Тогда
			
			Содержание = СтрЗаменить(Объект.Содержание, "<body", "<body contenteditable");
			Гипертекст.ДобавитьJSКод(Содержание);
			
			ТипСодержанияПисьма = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
			
		Иначе
			
			Содержание = Объект.Содержание;
			ТипСодержанияПисьма = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РаботаССодержаниемДляСуществующегоОбъекта()
	
	Если СтрНайти(Объект.Содержание, "<html") Тогда
		
		Содержание = СтрЗаменить(Объект.Содержание, "<body", "<body contenteditable");
		Гипертекст.ДобавитьJSКод(Содержание);
		
		ТипСодержанияПисьма = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
		
	Иначе
		
		Содержание = Объект.Содержание;
		ТипСодержанияПисьма = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзначальноеЗаполнениеРеквизитов()
	
	ЭтоНовыйОбъект = Объект.Ссылка.Пустая();
	ОбъектСозданКопированием = ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
	
	Если ЭтоНовыйОбъект И Не ОбъектСозданКопированием Тогда
		Объект.ВладелецПодписи = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияПослеЗаписиНаКлиенте(ЗакрытьОкно)
	
	Оповестить("Запись_ПодписьПисем", Объект.Ссылка);
	Если ЗакрытьОкно Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОсновныеПодписи

&НаСервере
Функция НужноЗадатьВопросОбУстановкеОсновнойПодписи(ЭтоНовыйОбъект)
	
	Если Не ЭтоНовыйОбъект Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Если Объект.ВладелецПодписи <> ТекущийПользователь Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Справочники.ПодписиПисем.ЕстьТолькоЭтаПодпись(Объект.Ссылка, ТекущийПользователь)
	И Не Справочники.ПодписиПисем.ЭтоОсновнаяПодпись(Объект.Ссылка, ТекущийПользователь);
	
КонецФункции

&НаКлиенте
Асинх Функция ВопросОбУстановкеОсновнойПодписи(ЗакрытьОкно)
	
	Ответ = Ждать ВопросАсинх(
	ТекстВопросаОВставкеПодписей(),
	РежимДиалогаВопрос.ДаНет);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВопросОбУстановкеОсновнойПодписиНаСервере(Объект.Ссылка);
	КонецЕсли;
	
	ДействияПослеЗаписиНаКлиенте(ЗакрытьОкно);
	
КонецФункции

&НаКлиенте
Функция ТекстВопросаОВставкеПодписей()
	
	КомпонентыФС = Новый Массив;
	
	Компонент1 = Новый ФорматированнаяСтрока(
	НСтр("ru = 'Установить подпись в качестве основной?'"), Новый Шрифт(, , Истина));
	Компонент2 = НСтр("ru = 'Основная подпись вставляется в текст письма автоматически.'");
	Компонент3 = НСтр("ru = 'Изменить настройки подписей можно в их списке по кнопке'");
	Компонент4 = НСтр("ru = '""Настройки основных подписей для учетных записей"".'");
	
	КомпонентыФС.Добавить(Компонент1);
	КомпонентыФС.Добавить(Символы.ПС + Символы.ПС);
	КомпонентыФС.Добавить(Компонент2);
	КомпонентыФС.Добавить(Символы.ПС);
	КомпонентыФС.Добавить(Компонент3);
	КомпонентыФС.Добавить(Символы.ПС);
	КомпонентыФС.Добавить(Компонент4);
	КомпонентыФС.Добавить(".");
	
	Возврат Новый ФорматированнаяСтрока(КомпонентыФС);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ВопросОбУстановкеОсновнойПодписиНаСервере(Знач Ссылка)
	
	Справочники.ПодписиПисем.УстановитьПодписьОсновнойДляВсехУчетныхЗаписей(Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ВидФормы

&НаСервере
Процедура УстановитьНачальныйВидФормы()
	
	ИзменитьФормуПоАктивномуТипуСодержания();
	
	УстановитьВидФормыПоПравамПользователя();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьФормуПоАктивномуТипуСодержания()
	
	ЭтоФорматHTML = (ТипСодержанияПисьма = Перечисления.ТипыТекстовЭлектронныхПисем.HTML);
	
	Элементы.СтраницыТипыСодержаний.ТекущаяСтраница =
	?(ЭтоФорматHTML, Элементы.СтраницаТекстHTML, Элементы.СтраницаПростойТекст);
	Элементы.АктивныйВидПисьма.Заголовок = ?(ЭтоФорматHTML, "HTML", НСтр("ru = 'Простой текст'"));
	
	Элементы.ФормаПереключательHTML.Пометка = ЭтоФорматHTML;
	Элементы.ФормаПереключательПростойТекст.Пометка = Не ЭтоФорматHTML;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидФормыПоПравамПользователя()
	
	Если Пользователи.ЭтоПолноправныйПользователь(Пользователи.ТекущийПользователь()) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ВладелецПодписи.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьФормуДляМобильногоКлиента()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.КомандыФорматированияСодержания.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСHTML

&НаКлиенте
Функция ПараметрыДляПередачиВМодульГипертекст()
	
	Возврат ГипертекстКлиент.ПараметрыДляПередачи(
	ЭтотОбъект,
	ДокументHTML,
	Элементы.Содержание.Имя,
	Элементы.КомандыФорматированияСодержания.Имя);
	
КонецФункции

#КонецОбласти

#КонецОбласти
